# importing Library

In [1]:
import pandas as pd

In [2]:
pd.__version__

'2.2.1'

# Pandas Series with Python list

In [3]:
lst = [1, 2, 3, 4, 5, 6]
print(lst)

[1, 2, 3, 4, 5, 6]

In [4]:
series = pd.Series(lst)
print(series)
print(type(series))

0    1
1    2
2    3
3    4
4    5
5    6
dtype: int64
<class 'pandas.core.series.Series'>

In [5]:
empty = pd.Series([])
empty

Series([], dtype: object)

In [6]:
a = pd.Series(['p', 'q', 'r', 's', 't'], index=[10, 11, 12, 13, 14])
a

10    p
11    q
12    r
13    s
14    t
dtype: object

In [7]:
b = pd.Series(['p', 'q', 'r', 's', 't'], index=[10, 11, 12, 13, 14], name='alphabets')
b

10    p
11    q
12    r
13    s
14    t
Name: alphabets, dtype: object

In [8]:
scalar_series = pd.Series(0.5)
scalar_series

0    0.5
dtype: float64

In [9]:
scalar_series = pd.Series(0.5, index=[1, 2, 3])
scalar_series

1    0.5
2    0.5
3    0.5
dtype: float64

# Pandas Series With Python Dictionary

In [10]:
dict_series = pd.Series({'p':1, 'q':2, 'r':3, 's':4, 't':5})
dict_series

p    1
q    2
r    3
s    4
t    5
dtype: int64

In [11]:
dict_series[0]

C:\Users\milan\AppData\Local\Temp\ipykernel_18576\1198263229.py:1: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  dict_series[0]

1

In [12]:
dict_series[0:3]

p    1
q    2
r    3
dtype: int64

In [13]:
max(dict_series)

5

In [14]:
dict_series = pd.Series({'p':[1, 2, 2], 'q':[4, 5, 6], 'r':[7, 8, 9], 's':[10, 11, 12], 't':[13, 14, 15]})
dict_series

p       [1, 2, 2]
q       [4, 5, 6]
r       [7, 8, 9]
s    [10, 11, 12]
t    [13, 14, 15]
dtype: object

# Pandas DataFrame

In [15]:
df = pd.DataFrame()
print(df)

Empty DataFrame
Columns: []
Index: []

# DataFrame Using List

In [16]:
lst = [1, 2, 3, 4, 5]
df = pd.DataFrame(lst)
df

   0
0  1
1  2
2  3
3  4
4  5

In [17]:
lst = [[1, 2, 3, 4, 5], [11, 12, 13, 14, 15]]
df = pd.DataFrame(lst)
df

    0   1   2   3   4
0   1   2   3   4   5
1  11  12  13  14  15

In [18]:
a = [{'a':5, 'b':7, 'c':9, 'd':2},
     {'a':4, 'b':8, 'c':19, 'd':12}]         #dictionary keys represents columns names

df = pd.DataFrame(a)
df

   a  b   c   d
0  5  7   9   2
1  4  8  19  12

In [19]:
b = {'Roll No.':pd.Series([1, 2, 3, 4, 4]),
     'Maths':pd.Series([67, 89, 23, 90, 56]),
     'Physics':pd.Series([12, 98, 44, 90, 78])}

df = pd.DataFrame(b)
df

   Roll No.  Maths  Physics
0         1     67       12
1         2     89       98
2         3     23       44
3         4     90       90
4         4     56       78

# Reading CSV(Common Separated Values) as DataFrame

df = pd.read_csv(fileAddress) # for import csv(excel file) file in here

df.columns # for know the columns of the data

df.shape # for know the total number of rows and columns

df.size # it's gives the number of sells in data

df.head() # it's give us first five rows

df.head(2) # it's give first 2 rows

df.tail() # it,s give us last five rows

df.tail(2) # it's gives last 2 rows

df.subscribe() # it's give us mathematical things ubout numeric data i.e. count, mean, max etc

df.info() # it's give us info about data

# Handling Missing Values

In [20]:
df = pd.read_csv("job_placement (1).csv")
df.head()

,id,name,gender,age,degree,stream,college_name,placement_status,salary,gpa,years_of_experience
0,1,John Doe,Male,25,Bachelor's,Computer Science,Harvard University,Placed,60000,3.7,2.0
1,2,Jane Smith,Female,24,Bachelor's,Electrical Engineering,Massachusetts Institute of Technology,Placed,65000,3.6,1.0
2,3,Michael Johnson,Male,26,Bachelor's,Mechanical Engineering,Stanford University,Placed,58000,3.8,3.0
3,4,Emily Davis,Female,23,Bachelor's,Information Technology,Yale University,Not Placed,0,3.5,2.0
4,5,David Brown,Male,24,Bachelor's,Computer Science,Princeton University,Placed,62000,3.9,2.0

In [21]:
print(df.isnull().sum())

id                     0
name                   0
gender                 0
age                    0
degree                 0
stream                 0
college_name           0
placement_status       0
salary                 0
gpa                    0
years_of_experience    1
dtype: int64

In [22]:
df.describe()

              id         age        salary         gpa  years_of_experience
count  700.00000  700.000000    700.000000  700.000000           699.000000
mean   350.50000   24.411429  52474.285714    3.750429             2.177396
std    202.21688    1.164268  25160.331005    0.121212             0.779393
min      1.00000   23.000000      0.000000    3.400000             1.000000
25%    175.75000   23.000000  61000.000000    3.700000             2.000000
50%    350.50000   24.000000  64000.000000    3.800000             2.000000
75%    525.25000   26.000000  66000.000000    3.900000             3.000000
max    700.00000   26.000000  68000.000000    3.900000             3.000000

In [23]:
print(df["stream"].duplicated().sum())

695

In [39]:
data = {
    "Calories": [420, 380, 390],
    "Duration": [50, 40, 45]
}

df = pd.DataFrame(data, index=["Day1", "Day2", "Day3"])

df

      Calories  Duration
Day1       420        50
Day2       380        40
Day3       390        45

In [45]:
df.loc[["Day2", "Day1"]]

      Calories  Duration
Day2       380        40
Day1       420        50

In [46]:
pd.options.display.max_rows

60